app/views/volunteers/_select_work.html.erb


<%= f.object.vol_job_day.all.inspect %>
---
SELECT "vol_job_days".* FROM "vol_job_days" WHERE "vol_job_days"."volunteer_id" = 5

        <div class="field">
          <%= ff.collection_select(:jobdescription_id, Jobdescription.all,
                         :id, :name) %>
---
SELECT "jobdescriptions".* FROM "jobdescriptions"