app/views/volunteers/index.html.erb

              <%= Time.now - @volcoordinator.absence_period.weeks %>:</b>
  <% absent = current_user.volunteer.absences.where( "day > ?",
              Time.now - @volcoordinator.absence_period.weeks) %>
---
SELECT "absences".* FROM "absences" WHERE "absences"."volunteer_id" = 1 GROUP BY recent
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = 2 LIMIT 1

  <h2>Notes</h2>
  <% current_user.volunteer.whiteboards.each do |whiteboard| %>
---
SELECT "volunteers".* FROM "volunteers"