app/views/volunteers/show.html.erb

<h2>Notes</h2>
<% @volunteer.whiteboards.each do |whiteboard| %>
---
SELECT "whiteboards".* FROM "whiteboards" WHERE "whiteboards"."volunteer_id" = 4