app/views/dept_supervisors/_form.html.erb

    <%= f.label :department_id %><br />
    <%= f.collection_select(:department_id, Department.all, :id, :name) %>
---
SELECT "departments".* FROM "departments"