app/views/volschedulers/index.html.erb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = 1 LIMIT 1
SELECT "jobdescriptions".* FROM "jobdescriptions" WHERE "jobdescriptions"."department_id" = 1
---
<%########### Table Content #########%>
  <% jd = @volscheduler.department.jobdescriptions.all %>