app/views/departments/_form.html.erb

SELECT "jobdescriptions".* FROM "jobdescriptions" WHERE "jobdescriptions"."department_id" = 2
---

  <% if !(f.object.jobdescriptions.empty?) %>