app/views/departments/index.html.erb

    <td><%= department.name %></td>
    <td><% department.jobdescriptions.each do |job| %>
---
SELECT "jobdescriptions".* FROM "jobdescriptions" WHERE "jobdescriptions"."department_id" = 1