app/views/departments/show.html.erb

<p>
  <% @department.jobdescriptions.each do |jd| %>
---
SELECT "jobdescriptions".* FROM "jobdescriptions" WHERE "jobdescriptions"."department_id" = 2