app/controllers/departments_controller.rb

  def edit
    @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "2"]]

  def update
    @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "2"]]

  def show
    @department = Department.find(params[:id])
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", "2"]]