app/controllers/dept_supervisors_controller.rb

SELECT "dept_supervisors".* FROM "dept_supervisors"
---
  def index
    @dept_supervisors = DeptSupervisor.all

SELECT "dept_supervisors".* FROM "dept_supervisors" WHERE "dept_supervisors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @dept_supervisor = DeptSupervisor.find(params[:id])