app/controllers/fosterer2s_controller.rb

  def index
    @fosterer2s = Fosterer2.all
    @volunteers=Volunteer.all
---
SELECT "fosterer2s".* FROM "fosterer2s"
SELECT "volunteers".* FROM "volunteers"