app/controllers/fosterers_controller.rb

SELECT "fosterers".* FROM "fosterers"
SELECT "volunteers".* FROM "volunteers"
---
  def index
    @fosterers = Fosterer.all
    @volunteers = Volunteer.all