app/controllers/orientations_controller.rb

SELECT "orientations".* FROM "orientations"
---
  def index
    @orientations = Orientation.all

SELECT "orientations".* FROM "orientations" WHERE "orientations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @orientation = Orientation.find(params[:id])

SELECT "orientations".* FROM "orientations" WHERE "orientations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @orientation = Orientation.find(params[:id])

INSERT INTO "orientations" ("created_at", "date", "datetime", "numCurrParticipant", "participantMax", "presenter", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @orientation = Orientation.new(params[:orientation])
    @orientation.numCurrParticipant = 0

    respond_to do |format|
      if @orientation.save

SELECT "orientations".* FROM "orientations" WHERE "orientations"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."orientation_id" = 1
UPDATE "orientations" SET "numCurrParticipant" = 1, "updated_at" = '2013-10-16 05:12:51.874880' WHERE "orientations"."id" = 1
---
  def update
    @orientation = Orientation.find(params[:id])
    volunteer = nil

    if !params[:id].nil?
      params.each do |p|
        if p[0].to_s.match("delOrien_*")
          id = p[0].to_s.slice(9..-1).to_i
          volunteer = Volunteer.find(id)

          volunteer.orientation.numCurrParticipant = volunteer.orientation.numCurrParticipant - 1
          volunteer.orientation.save

SELECT "orientations".* FROM "orientations" WHERE "orientations"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."orientation_id" = 1
DELETE FROM "orientations" WHERE "orientations"."id" = ?  [["id", 1]]
---
  def destroy
    @orientation = Orientation.find(params[:id])
    @orientation.volunteers.each do |v|
      v.orientation_id = 1
      v.save

      #v.orientation.numCurrParticipant = v.orientation.numCurrParticipant + 1
      #v.orientation.save
    end
    @orientation.destroy