app/controllers/roster_coordinators_controller.rb

  def index
    @roster_coordinators = RosterCoordinator.all
---
SELECT "roster_coordinators".* FROM "roster_coordinators"

  def show
    @roster_coordinator = RosterCoordinator.find(params[:id])
---
SELECT "roster_coordinators".* FROM "roster_coordinators" WHERE "roster_coordinators"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @roster_coordinator = RosterCoordinator.find(params[:id])
---
SELECT "roster_coordinators".* FROM "roster_coordinators" WHERE "roster_coordinators"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @roster_coordinator = RosterCoordinator.new(params[:roster_coordinator])

    respond_to do |format|
      if @roster_coordinator.save
---
INSERT INTO "roster_coordinators" ("created_at", "department_id", "firstname", "lastname", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 16 Oct 2013 04:34:42 UTC +00:00], ["department_id", nil], ["firstname", nil], ["lastname", nil], ["title", nil], ["updated_at", Wed, 16 Oct 2013 04:34:42 UTC +00:00]]

  def update
    @roster_coordinator = RosterCoordinator.find(params[:id])
---
SELECT "roster_coordinators".* FROM "roster_coordinators" WHERE "roster_coordinators"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @roster_coordinator = RosterCoordinator.find(params[:id])
    @roster_coordinator.destroy
---
SELECT "roster_coordinators".* FROM "roster_coordinators" WHERE "roster_coordinators"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "roster_coordinators" WHERE "roster_coordinators"."id" = ?  [["id", 1]]