app/controllers/volschedulers_controller.rb

  def index
    @volscheduler = Volscheduler.first
    @volunteers = Volunteer.all
---
SELECT "volschedulers".* FROM "volschedulers" LIMIT 1
SELECT "volunteers".* FROM "volunteers"

  def update
    @volscheduler = Volscheduler.first
    @volunteers = Volunteer.all
    @absence = Absence.new

puts ########## testing ###############################
@volunteers.inspect

    if !params[:id].nil?
      params.each do |p|
        if p[0].to_s.match("vol_*")
          id = p[0].to_s.slice(4..-1).to_i
          absent = Absence.new(day: Date.parse(params["date"]), volunteer_id: id)
          absent.save
---
SELECT "volschedulers".* FROM "volschedulers" LIMIT 1
SELECT "volunteers".* FROM "volunteers"
INSERT INTO "absences" ("created_at", "day", "updated_at", "volunteer_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Sep 2013 22:16:44 UTC +00:00], ["day", nil], ["updated_at", Thu, 26 Sep 2013 22:16:44 UTC +00:00], ["volunteer_id", 1]]