app/controllers/volunteers_controller.rb

  def index
    @volunteers = Volunteer.all
    @volcoordinator = Volcoordinator.first
---
SELECT "volunteers".* FROM "volunteers"
SELECT "volcoordinators".* FROM "volcoordinators" LIMIT 1

  def show
    @volunteer = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", "4"]]

  def edit
    @volunteer = Volunteer.find(params[:id])
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", "5"]]

  def update
    @volunteer = Volunteer.find(params[:id])

puts "########################## AAAAARGH !!!! ###############"
puts params.inspect
    d = Array.new
    if !params[:id].nil?
      d[0] = params[:volunteer][:vol_job_day_attributes]["0"][:frequency_attributes]
      d[1] = params[:volunteer][:vol_job_day_attributes]["1"][:frequency_attributes]
      d[2] = params[:volunteer][:vol_job_day_attributes]["2"][:frequency_attributes]
      d[3] = params[:volunteer][:vol_job_day_attributes]["3"][:frequency_attributes]
      d[4] = params[:volunteer][:vol_job_day_attributes]["4"][:frequency_attributes]
      d[5] = params[:volunteer][:vol_job_day_attributes]["5"][:frequency_attributes]
      d[6] = params[:volunteer][:vol_job_day_attributes]["6"][:frequency_attributes]
 #       if p1[0].to_s.match("volunteer")
puts "########################## BBBAARGH !!!! ###############"
puts d[0][:name]

      i = 0
      @volunteer.frequencies.each do |freq|
---
SELECT "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = ? LIMIT 1  [["id", "5"]]
SELECT "frequencies".* FROM "frequencies" WHERE "frequencies"."id" = 29 LIMIT 1

=end

    respond_to do |format|
      if @volunteer.update_attributes(params[:volunteer])
---
UPDATE "volunteers" SET "break_from" = '2013-09-27', "break_to" = '2013-10-10', "updated_at" = '2013-09-27 00:53:50.348562' WHERE "volunteers"."id" = 1